#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_eks_access_entry.access will be created
  + resource "aws_eks_access_entry" "access" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "restaurant-34-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "master",
          + "worker",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::035133178716:role/voclabs"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.policy will be created
  + resource "aws_eks_access_policy_association" "policy" {
      + associated_at = (known after apply)
      + cluster_name  = "restaurant-34-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::035133178716:role/voclabs"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.restaurant-34-cluster will be created
  + resource "aws_eks_cluster" "restaurant-34-cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "restaurant-34-cluster"
      + platform_version      = (known after apply)
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)
        # (1 unchanged attribute hidden)

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = [
              + "sg-00d5ce21a29ae0348",
            ]
          + subnet_ids                = [
              + "subnet-0b91f4af0cdac33af",
              + "subnet-0c3c0b0fc3a87085e",
              + "subnet-0fb050ffc19fe52e5",
            ]
          + vpc_id                    = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @ySodias, Action: `pull_request`*